MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW37Z512VFT4/mcu.h
/*! @name SM_CFG - PHY State Machine Config */
/*! @{ */
#define XCVR_2P4GHZ_PHY_SM_CFG_ACQ_MODE_MASK     (0x3U)
#define XCVR_2P4GHZ_PHY_SM_CFG_ACQ_MODE_SHIFT    (0U)
/*! ACQ_MODE - Acquisition mode for non-coded reception
 *  0b00..Reserved
 *  0b01..Use preamble and verify a correlation peak, the synch at the symbol rate as symbol timing is established by the preamble acquisition
 *  0b10..Use synch only (which may incorporate part of the preamble)
 *  0b11..Use mainly the sync detection: Use a low threshold on the preamble detector and launch the synch
 *        detection only if the preamble has shown a recent peak
 */
#define XCVR_2P4GHZ_PHY_SM_CFG_ACQ_MODE(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_SM_CFG_ACQ_MODE_SHIFT)) & XCVR_2P4GHZ_PHY_SM_CFG_ACQ_MODE_MASK)
#define XCVR_2P4GHZ_PHY_SM_CFG_EN_PHY_SM_EXT_RST_MASK (0x4U)
#define XCVR_2P4GHZ_PHY_SM_CFG_EN_PHY_SM_EXT_RST_SHIFT (2U)
/*! EN_PHY_SM_EXT_RST - Reserved, should keep 0.
 */
#define XCVR_2P4GHZ_PHY_SM_CFG_EN_PHY_SM_EXT_RST(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_SM_CFG_EN_PHY_SM_EXT_RST_SHIFT)) & XCVR_2P4GHZ_PHY_SM_CFG_EN_PHY_SM_EXT_RST_MASK)
#define XCVR_2P4GHZ_PHY_SM_CFG_AGC_FRZ_ON_PD_FOUND_ACQ1_LR_MASK (0x8U)
#define XCVR_2P4GHZ_PHY_SM_CFG_AGC_FRZ_ON_PD_FOUND_ACQ1_LR_SHIFT (3U)
/*! AGC_FRZ_ON_PD_FOUND_ACQ1_LR - Specfies AGC freeze condition for non-coded acq.1 and Bluetooth LE long range.
 *  0b0..AGC freeze on AA found.
 *  0b1..AGC freeze asserted on PD found.
 */
#define XCVR_2P4GHZ_PHY_SM_CFG_AGC_FRZ_ON_PD_FOUND_ACQ1_LR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_SM_CFG_AGC_FRZ_ON_PD_FOUND_ACQ1_LR_SHIFT)) & XCVR_2P4GHZ_PHY_SM_CFG_AGC_FRZ_ON_PD_FOUND_ACQ1_LR_MASK)
#define XCVR_2P4GHZ_PHY_SM_CFG_PH_BUFF_PTR_SYM_MASK (0x30U)
#define XCVR_2P4GHZ_PHY_SM_CFG_PH_BUFF_PTR_SYM_SHIFT (4U)
/*! PH_BUFF_PTR_SYM - Phase buffer size to demodulator, long range only.
 */
#define XCVR_2P4GHZ_PHY_SM_CFG_PH_BUFF_PTR_SYM(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_SM_CFG_PH_BUFF_PTR_SYM_SHIFT)) & XCVR_2P4GHZ_PHY_SM_CFG_PH_BUFF_PTR_SYM_MASK)
#define XCVR_2P4GHZ_PHY_SM_CFG_EARLY_PD_TIMEOUT_MASK (0x3F00U)
#define XCVR_2P4GHZ_PHY_SM_CFG_EARLY_PD_TIMEOUT_SHIFT (8U)
/*! EARLY_PD_TIMEOUT - Time-out used to reset the AGC state-machine for the eventuality that an "PD
 *    found early" event occurs but it is not followed by an "PD found" event
 */
#define XCVR_2P4GHZ_PHY_SM_CFG_EARLY_PD_TIMEOUT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_SM_CFG_EARLY_PD_TIMEOUT_SHIFT)) & XCVR_2P4GHZ_PHY_SM_CFG_EARLY_PD_TIMEOUT_MASK)
#define XCVR_2P4GHZ_PHY_SM_CFG_AA_TIMEOUT_UNCODED_MASK (0x3FF0000U)
#define XCVR_2P4GHZ_PHY_SM_CFG_AA_TIMEOUT_UNCODED_SHIFT (16U)
/*! AA_TIMEOUT_UNCODED - Time-out value for access address search for uncoded packets
 */
#define XCVR_2P4GHZ_PHY_SM_CFG_AA_TIMEOUT_UNCODED(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_SM_CFG_AA_TIMEOUT_UNCODED_SHIFT)) & XCVR_2P4GHZ_PHY_SM_CFG_AA_TIMEOUT_UNCODED_MASK)
/*! @} */

/*! @name MISC - PHY Misc Config */
/*! @{ */
#define XCVR_2P4GHZ_PHY_MISC_RSSI_CORR_TH_MASK   (0xFFU)
#define XCVR_2P4GHZ_PHY_MISC_RSSI_CORR_TH_SHIFT  (0U)
/*! RSSI_CORR_TH - Threshold use to compare a correlation magnitude value, computed in the
 *    acquisition block, in order to determine the correlation flag value provided by the PHY to the LQI
 *    computation block. Format is ufix8_En8
 */
#define XCVR_2P4GHZ_PHY_MISC_RSSI_CORR_TH(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_MISC_RSSI_CORR_TH_SHIFT)) & XCVR_2P4GHZ_PHY_MISC_RSSI_CORR_TH_MASK)
#define XCVR_2P4GHZ_PHY_MISC_DMA_PAGE_SEL_MASK   (0x700U)
#define XCVR_2P4GHZ_PHY_MISC_DMA_PAGE_SEL_SHIFT  (8U)
/*! DMA_PAGE_SEL - Select which DMA page is send out
 *  0b000..Select DMA PAGE 0 for M3C with cfo;
 *  0b001..Select DMA PAGE 1 for M3C with magnitude;
 *  0b010..Select DMA PAGE 2 for un-coded;
 *  0b011..Select DMA PAGE 3 for Long Range Preampble Detect;
 *  0b100..Select DMA PAGE 4 for Long Range AA Detect;
 */
#define XCVR_2P4GHZ_PHY_MISC_DMA_PAGE_SEL(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_MISC_DMA_PAGE_SEL_SHIFT)) & XCVR_2P4GHZ_PHY_MISC_DMA_PAGE_SEL_MASK)
#define XCVR_2P4GHZ_PHY_MISC_ECO1_RSVD_MASK      (0xF800U)
#define XCVR_2P4GHZ_PHY_MISC_ECO1_RSVD_SHIFT     (11U)
/*! ECO1_RSVD - Reserved. Must be programed as reset value 0.
 */
#define XCVR_2P4GHZ_PHY_MISC_ECO1_RSVD(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_MISC_ECO1_RSVD_SHIFT)) & XCVR_2P4GHZ_PHY_MISC_ECO1_RSVD_MASK)
#define XCVR_2P4GHZ_PHY_MISC_PHY_CLK_CTRL_MASK   (0x3FF0000U)
#define XCVR_2P4GHZ_PHY_MISC_PHY_CLK_CTRL_SHIFT  (16U)
/*! PHY_CLK_CTRL - Enables various clock gating features. Bits are individually decoded, so any combination is allowable.
 */
#define XCVR_2P4GHZ_PHY_MISC_PHY_CLK_CTRL(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_MISC_PHY_CLK_CTRL_SHIFT)) & XCVR_2P4GHZ_PHY_MISC_PHY_CLK_CTRL_MASK)
#define XCVR_2P4GHZ_PHY_MISC_ECO2_RSVD_MASK      (0x3C000000U)
#define XCVR_2P4GHZ_PHY_MISC_ECO2_RSVD_SHIFT     (26U)
/*! ECO2_RSVD - Reserved
 */
#define XCVR_2P4GHZ_PHY_MISC_ECO2_RSVD(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_MISC_ECO2_RSVD_SHIFT)) & XCVR_2P4GHZ_PHY_MISC_ECO2_RSVD_MASK)
#define XCVR_2P4GHZ_PHY_MISC_DTEST_MUX_EN_MASK   (0x40000000U)
#define XCVR_2P4GHZ_PHY_MISC_DTEST_MUX_EN_SHIFT  (30U)
/*! DTEST_MUX_EN - Reserved. Should be programed as reset value 0.
 */
#define XCVR_2P4GHZ_PHY_MISC_DTEST_MUX_EN(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_MISC_DTEST_MUX_EN_SHIFT)) & XCVR_2P4GHZ_PHY_MISC_DTEST_MUX_EN_MASK)
#define XCVR_2P4GHZ_PHY_MISC_PHY_CLK_ON_MASK     (0x80000000U)
#define XCVR_2P4GHZ_PHY_MISC_PHY_CLK_ON_SHIFT    (31U)
/*! PHY_CLK_ON - Force PHY clock ON
 */
#define XCVR_2P4GHZ_PHY_MISC_PHY_CLK_ON(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_MISC_PHY_CLK_ON_SHIFT)) & XCVR_2P4GHZ_PHY_MISC_PHY_CLK_ON_MASK)
/*! @} */

/*! @name STAT0 - PHY Status 0 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_STAT0_PD_FOUND_MASK      (0x1U)
#define XCVR_2P4GHZ_PHY_STAT0_PD_FOUND_SHIFT     (0U)
/*! PD_FOUND - PD_FOUND for LR or uncoded
 */
#define XCVR_2P4GHZ_PHY_STAT0_PD_FOUND(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT0_PD_FOUND_SHIFT)) & XCVR_2P4GHZ_PHY_STAT0_PD_FOUND_MASK)
#define XCVR_2P4GHZ_PHY_STAT0_LR_DET_FLAG_MASK   (0x2U)
#define XCVR_2P4GHZ_PHY_STAT0_LR_DET_FLAG_SHIFT  (1U)
/*! LR_DET_FLAG - Indicates Bluetooth LE long range was detected
 */
#define XCVR_2P4GHZ_PHY_STAT0_LR_DET_FLAG(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT0_LR_DET_FLAG_SHIFT)) & XCVR_2P4GHZ_PHY_STAT0_LR_DET_FLAG_MASK)
#define XCVR_2P4GHZ_PHY_STAT0_AA_MATCHED_MASK    (0x4U)
#define XCVR_2P4GHZ_PHY_STAT0_AA_MATCHED_SHIFT   (2U)
/*! AA_MATCHED - Indicates AA was matched for LR or uncoded
 */
#define XCVR_2P4GHZ_PHY_STAT0_AA_MATCHED(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT0_AA_MATCHED_SHIFT)) & XCVR_2P4GHZ_PHY_STAT0_AA_MATCHED_MASK)
#define XCVR_2P4GHZ_PHY_STAT0_AA_FOUND_ID_MASK   (0x38U)
#define XCVR_2P4GHZ_PHY_STAT0_AA_FOUND_ID_SHIFT  (3U)
/*! AA_FOUND_ID - Indicates which AA was matched for LR and uncode
 *  0b000..uncoded address 0 matched
 *  0b001..uncoded address 1 matched
 *  0b010..uncoded address 2 matched
 *  0b011..uncoded address 3 matched
 *  0b100..long range address matched
 */
#define XCVR_2P4GHZ_PHY_STAT0_AA_FOUND_ID(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT0_AA_FOUND_ID_SHIFT)) & XCVR_2P4GHZ_PHY_STAT0_AA_FOUND_ID_MASK)
#define XCVR_2P4GHZ_PHY_STAT0_DATA_RATE_MASK     (0xC0U)
#define XCVR_2P4GHZ_PHY_STAT0_DATA_RATE_SHIFT    (6U)
/*! DATA_RATE - Indicates the data rate of received bit
 *  0b00..1Mbps
 *  0b01..2Mbps
 *  0b10..125kbps
 *  0b11..500kbps
 */
#define XCVR_2P4GHZ_PHY_STAT0_DATA_RATE(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT0_DATA_RATE_SHIFT)) & XCVR_2P4GHZ_PHY_STAT0_DATA_RATE_MASK)
#define XCVR_2P4GHZ_PHY_STAT0_FRAC_MASK          (0x3F00U)
#define XCVR_2P4GHZ_PHY_STAT0_FRAC_SHIFT         (8U)
/*! FRAC - Indicates the fractional timing estimate determined in the acquisition block. Format is
 *    sfix6_en5(sign extend from sfix3_En2).
 */
#define XCVR_2P4GHZ_PHY_STAT0_FRAC(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT0_FRAC_SHIFT)) & XCVR_2P4GHZ_PHY_STAT0_FRAC_MASK)
#define XCVR_2P4GHZ_PHY_STAT0_CFO_EST_MASK       (0x3FF0000U)
#define XCVR_2P4GHZ_PHY_STAT0_CFO_EST_SHIFT      (16U)
/*! CFO_EST - Indicates the currently estimated CFO. Format is sfix10_en9(sign extend form sfix8_en9)
 */
#define XCVR_2P4GHZ_PHY_STAT0_CFO_EST(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT0_CFO_EST_SHIFT)) & XCVR_2P4GHZ_PHY_STAT0_CFO_EST_MASK)
/*! @} */

