MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW37Z512VFT4/mcu.h
/*! @name DCOC_TZA_STEP_7 - DCOC TZA DAC Step 7 */
/*! @{ */
#define XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_RCP_7_MASK (0x1FFFU)
#define XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_RCP_7_SHIFT (0U)
/*! DCOC_TZA_STEP_RCP_7 - DCOC_TZA_STEP_RCP_7
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_RCP_7(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_RCP_7_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_RCP_7_MASK)
#define XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_GAIN_7_MASK (0x1FFF0000U)
#define XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_GAIN_7_SHIFT (16U)
/*! DCOC_TZA_STEP_GAIN_7 - DCOC_TZA_STEP_GAIN_7
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_GAIN_7(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_GAIN_7_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_7_DCOC_TZA_STEP_GAIN_7_MASK)
/*! @} */

/*! @name DCOC_TZA_STEP_8 - DCOC TZA DAC Step 5 */
/*! @{ */
#define XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_RCP_8_MASK (0x1FFFU)
#define XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_RCP_8_SHIFT (0U)
/*! DCOC_TZA_STEP_RCP_8 - DCOC_TZA_STEP_RCP_8
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_RCP_8(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_RCP_8_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_RCP_8_MASK)
#define XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_GAIN_8_MASK (0x1FFF0000U)
#define XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_GAIN_8_SHIFT (16U)
/*! DCOC_TZA_STEP_GAIN_8 - DCOC_TZA_STEP_GAIN_8
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_GAIN_8(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_GAIN_8_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_8_DCOC_TZA_STEP_GAIN_8_MASK)
/*! @} */

/*! @name DCOC_TZA_STEP_9 - DCOC TZA DAC Step 9 */
/*! @{ */
#define XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_RCP_9_MASK (0x1FFFU)
#define XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_RCP_9_SHIFT (0U)
/*! DCOC_TZA_STEP_RCP_9 - DCOC_TZA_STEP_RCP_9
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_RCP_9(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_RCP_9_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_RCP_9_MASK)
#define XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_GAIN_9_MASK (0x3FFF0000U)
#define XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_GAIN_9_SHIFT (16U)
/*! DCOC_TZA_STEP_GAIN_9 - DCOC_TZA_STEP_GAIN_9
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_GAIN_9(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_GAIN_9_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_9_DCOC_TZA_STEP_GAIN_9_MASK)
/*! @} */

/*! @name DCOC_TZA_STEP_10 - DCOC TZA DAC Step 10 */
/*! @{ */
#define XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_RCP_10_MASK (0x1FFFU)
#define XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_RCP_10_SHIFT (0U)
/*! DCOC_TZA_STEP_RCP_10 - DCOC_TZA_STEP_RCP_10
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_RCP_10(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_RCP_10_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_RCP_10_MASK)
#define XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_GAIN_10_MASK (0x3FFF0000U)
#define XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_GAIN_10_SHIFT (16U)
/*! DCOC_TZA_STEP_GAIN_10 - DCOC_TZA_STEP_GAIN_10
 */
#define XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_GAIN_10(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_GAIN_10_SHIFT)) & XCVR_RX_DIG_DCOC_TZA_STEP_10_DCOC_TZA_STEP_GAIN_10_MASK)
/*! @} */

/*! @name FRAC_CORR_OVRD - FRAC CORR Override */
/*! @{ */
#define XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_EN_MASK (0x1U)
#define XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_EN_SHIFT (0U)
/*! FRAC_CORR_OVRD_EN - FRAC CORR Override Enable
 */
#define XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_EN_SHIFT)) & XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_EN_MASK)
#define XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_MASK (0x70U)
#define XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_SHIFT (4U)
/*! FRAC_CORR_OVRD - FRAC CORR Override Value
 */
#define XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_SHIFT)) & XCVR_RX_DIG_FRAC_CORR_OVRD_FRAC_CORR_OVRD_MASK)
/*! @} */

/*! @name CFO_EST_OVRD - CFO Estimate Override */
/*! @{ */
#define XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_EN_MASK (0x1U)
#define XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_EN_SHIFT (0U)
/*! CFO_EST_OVRD_EN - CFO Estimate Override Enable
 */
#define XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_EN_SHIFT)) & XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_EN_MASK)
#define XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_MASK (0x3FF0U)
#define XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_SHIFT (4U)
/*! CFO_EST_OVRD - CFO Estimate Override Value
 */
#define XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_SHIFT)) & XCVR_RX_DIG_CFO_EST_OVRD_CFO_EST_OVRD_MASK)
/*! @} */

/*! @name RX_D_CHF_COEF_0 - Receive Demod Channel Filter Coef 0 */
/*! @{ */
#define XCVR_RX_DIG_RX_D_CHF_COEF_0_RX_D_CH_FILT_H0_MASK (0x1FFU)
#define XCVR_RX_DIG_RX_D_CHF_COEF_0_RX_D_CH_FILT_H0_SHIFT (0U)
/*! RX_D_CH_FILT_H0 - RX Demod Channel Filter Coefficient 0
 */
#define XCVR_RX_DIG_RX_D_CHF_COEF_0_RX_D_CH_FILT_H0(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_RX_D_CHF_COEF_0_RX_D_CH_FILT_H0_SHIFT)) & XCVR_RX_DIG_RX_D_CHF_COEF_0_RX_D_CH_FILT_H0_MASK)
/*! @} */

/*! @name RX_D_CHF_COEF_1 - Receive Demod Channel Filter Coef 1 */
/*! @{ */
#define XCVR_RX_DIG_RX_D_CHF_COEF_1_RX_D_CH_FILT_H1_MASK (0x1FFU)
#define XCVR_RX_DIG_RX_D_CHF_COEF_1_RX_D_CH_FILT_H1_SHIFT (0U)
/*! RX_D_CH_FILT_H1 - RX Demod Channel Filter Coefficient 1
 */
#define XCVR_RX_DIG_RX_D_CHF_COEF_1_RX_D_CH_FILT_H1(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_RX_D_CHF_COEF_1_RX_D_CH_FILT_H1_SHIFT)) & XCVR_RX_DIG_RX_D_CHF_COEF_1_RX_D_CH_FILT_H1_MASK)
/*! @} */

/*! @name RX_D_CHF_COEF_2 - Receive Demod Channel Filter Coef 2 */
/*! @{ */
#define XCVR_RX_DIG_RX_D_CHF_COEF_2_RX_D_CH_FILT_H2_MASK (0x3FFU)
#define XCVR_RX_DIG_RX_D_CHF_COEF_2_RX_D_CH_FILT_H2_SHIFT (0U)
/*! RX_D_CH_FILT_H2 - RX Demod Channel Filter Coefficient 2
 */
#define XCVR_RX_DIG_RX_D_CHF_COEF_2_RX_D_CH_FILT_H2(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_RX_D_CHF_COEF_2_RX_D_CH_FILT_H2_SHIFT)) & XCVR_RX_DIG_RX_D_CHF_COEF_2_RX_D_CH_FILT_H2_MASK)
/*! @} */

/*! @name RX_D_CHF_COEF_3 - Receive Demod Channel Filter Coef 3 */
/*! @{ */
#define XCVR_RX_DIG_RX_D_CHF_COEF_3_RX_D_CH_FILT_H3_MASK (0x3FFU)
#define XCVR_RX_DIG_RX_D_CHF_COEF_3_RX_D_CH_FILT_H3_SHIFT (0U)
/*! RX_D_CH_FILT_H3 - RX Demod Channel Filter Coefficient 3
 */
#define XCVR_RX_DIG_RX_D_CHF_COEF_3_RX_D_CH_FILT_H3(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_RX_D_CHF_COEF_3_RX_D_CH_FILT_H3_SHIFT)) & XCVR_RX_DIG_RX_D_CHF_COEF_3_RX_D_CH_FILT_H3_MASK)
/*! @} */

/*! @name RX_D_CHF_COEF_4 - Receive Demod Channel Filter Coef 4 */
/*! @{ */
#define XCVR_RX_DIG_RX_D_CHF_COEF_4_RX_D_CH_FILT_H4_MASK (0x3FFU)
#define XCVR_RX_DIG_RX_D_CHF_COEF_4_RX_D_CH_FILT_H4_SHIFT (0U)
/*! RX_D_CH_FILT_H4 - RX Demod Channel Filter Coefficient 4
 */
#define XCVR_RX_DIG_RX_D_CHF_COEF_4_RX_D_CH_FILT_H4(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_RX_D_CHF_COEF_4_RX_D_CH_FILT_H4_SHIFT)) & XCVR_RX_DIG_RX_D_CHF_COEF_4_RX_D_CH_FILT_H4_MASK)
/*! @} */

/*! @name DCOC_CAL_FAIL_TH - DCOC Calibration Fail Thresholds */
/*! @{ */
#define XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_BETA_F_TH_MASK (0x7FFU)
#define XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_BETA_F_TH_SHIFT (0U)
/*! DCOC_CAL_BETA_F_TH - DCOC Calibration Beta Fail Threshold
 */
#define XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_BETA_F_TH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_BETA_F_TH_SHIFT)) & XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_BETA_F_TH_MASK)
#define XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_ALPHA_F_TH_MASK (0x3FF0000U)
#define XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_ALPHA_F_TH_SHIFT (16U)
/*! DCOC_CAL_ALPHA_F_TH - DCOC Calibration Alpha Fail Threshold
 */
#define XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_ALPHA_F_TH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_ALPHA_F_TH_SHIFT)) & XCVR_RX_DIG_DCOC_CAL_FAIL_TH_DCOC_CAL_ALPHA_F_TH_MASK)
/*! @} */

/*! @name DCOC_CAL_PASS_TH - DCOC Calibration Pass Thresholds */
/*! @{ */
#define XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_BETA_P_TH_MASK (0x7FFU)
#define XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_BETA_P_TH_SHIFT (0U)
/*! DCOC_CAL_BETA_P_TH - DCOC Calibration Beta Pass Threshold
 */
#define XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_BETA_P_TH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_BETA_P_TH_SHIFT)) & XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_BETA_P_TH_MASK)
#define XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_ALPHA_P_TH_MASK (0x3FF0000U)
#define XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_ALPHA_P_TH_SHIFT (16U)
/*! DCOC_CAL_ALPHA_P_TH - DCOC Calibration Alpha Pass Threshold
 */
#define XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_ALPHA_P_TH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_ALPHA_P_TH_SHIFT)) & XCVR_RX_DIG_DCOC_CAL_PASS_TH_DCOC_CAL_ALPHA_P_TH_MASK)
/*! @} */

/*! @name DCOC_CAL_ALPHA - DCOC Calibration Alpha */
/*! @{ */
#define XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_I_MASK (0x7FFU)
#define XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_I_SHIFT (0U)
/*! DCOC_CAL_ALPHA_I - DCOC Calibration I-channel ALPHA constant
 */
#define XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_I(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_I_SHIFT)) & XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_I_MASK)
#define XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_Q_MASK (0x7FF0000U)
#define XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_Q_SHIFT (16U)
/*! DCOC_CAL_ALPHA_Q - DCOC_CAL_ALPHA_Q
 */
#define XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_Q_SHIFT)) & XCVR_RX_DIG_DCOC_CAL_ALPHA_DCOC_CAL_ALPHA_Q_MASK)
/*! @} */

/*! @name DCOC_CAL_BETA_Q - DCOC Calibration Beta Q */
/*! @{ */
#define XCVR_RX_DIG_DCOC_CAL_BETA_Q_DCOC_CAL_BETA_Q_MASK (0x1FFFFU)
#define XCVR_RX_DIG_DCOC_CAL_BETA_Q_DCOC_CAL_BETA_Q_SHIFT (0U)
/*! DCOC_CAL_BETA_Q - DCOC_CAL_BETA_Q
 */
#define XCVR_RX_DIG_DCOC_CAL_BETA_Q_DCOC_CAL_BETA_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_CAL_BETA_Q_DCOC_CAL_BETA_Q_SHIFT)) & XCVR_RX_DIG_DCOC_CAL_BETA_Q_DCOC_CAL_BETA_Q_MASK)
/*! @} */

